Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: For more details about how to query data about processes and user tasks, please visit https://docs.kogito.kie.org/latest/html_single/#ref-data-index-service-queries_kogito-configuring[Kogito Data Index documentation].
ja_jp: プロセスやユーザー・タスクに関するデータを照会する方法の詳細については、 link:https://docs.kogito.kie.org/latest/html_single/#ref-data-index-service-queries_kogito-configuring[Kogito Data Index ドキュメント]をご覧ください。

source: For more details about the available properties and how do they work, see the link:https://github.com/k8s-service-bindings/spec#workload-projection[Workload Projection] part of the Service Binding specification.
ja_jp: 利用可能なプロパティーとその動作の詳細については、Service Binding 仕様 の link:https://github.com/k8s-service-bindings/spec#workload-projection[Workload Projection] の部分を参照してください。

source: For more details about the available properties and how do they work, see the link:https://github.com/servicebinding/spec#workload-projection[Workload Projection] part of the Service Binding specification.
ja_jp: 利用可能なプロパティーとその動作の詳細については、Service Binding 仕様 の link:https://github.com/servicebinding/spec#workload-projection[Workload Projection] の部分を参照してください。

source: For more details and optional configurations, see xref:databases-dev-services.adoc[Dev Services for databases].
ja_jp: 詳細およびオプション設定については、 xref:databases-dev-services.adoc[Dev Services for databases] を参照してください。

source: For more details consult https://www.keycloak.org/docs/latest/server_development/#admin-rest-api[Keycloak Admin REST API documentation].
ja_jp: 詳細については、 link:https://www.keycloak.org/docs/latest/server_development/#admin-rest-api[Keycloak Admin REST APIドキュメント] を参照してください。

source: For more details on the Qute features included in Quarkus Tools for Visual Studio code, take a look at the https://github.com/redhat-developer/vscode-quarkus/tree/master/docs/qute[documentation], and learn more about the capabilities of the Qute Templating Engine from the https://quarkus.io/guides/qute[Qute Reference Guide].
ja_jp: Quarkus Tools for Visual Studio コードに含まれる Qute 機能の詳細については、 link:https://github.com/redhat-developer/vscode-quarkus/tree/master/docs/qute[ドキュメント]を参照し てください。また、Qute テンプレーティングエンジンの機能については、 link:https://quarkus.io/guides/qute[Qute Reference Guide]を参照 してください。

source: For more details on the format of this file, please refer to https://github.com/oracle/graal/blob/master/docs/reference-manual/native-image/Reflection.md[the GraalVM documentation].
ja_jp: このファイルのフォーマットの詳細については、 link:https://github.com/oracle/graal/blob/master/docs/reference-manual/native-image/Reflection.md[GraalVMのドキュメント]を参照してください。

source: For more details on the format of this file, please refer to https://www.graalvm.org/{graalvm-version}/reference-manual/native-image/dynamic-features/Reflection/[the GraalVM documentation].
ja_jp: このファイルのフォーマットの詳細については、 https://www.graalvm.org/{graalvm-version}/reference-manual/native-image/dynamic-features/Reflection/[GraalVMのドキュメント]を参照してください。

source: For more details on using JFR, see https://www.graalvm.org/reference-manual/native-image/JFR[here].
ja_jp: JFRの利用方法については link:https://www.graalvm.org/reference-manual/native-image/JFR[こちら]をご覧ください。

source: For more details on using JFR, see https://www.graalvm.org/{graalvm-version}/reference-manual/native-image/debugging-and-diagnostics/JFR/[here].
ja_jp: JFR の使い方の詳細は、 https://www.graalvm.org/{graalvm-version}/reference-manual/native-image/debugging-and-diagnostics/JFR/[こちら] をご覧ください。

source: For more details on using multiple outgoings, please refer to the http://smallrye.io/smallrye-reactive-messaging/4.10.0/concepts/outgoings/[SmallRye Reactive Messaging documentation].
ja_jp: 複数出庫の詳細については、 link:http://smallrye.io/smallrye-reactive-messaging/4.10.0/concepts/outgoings/[SmallRye Reactive Messaging のドキュメント] を参照してください。

source: For more details please refer to the https://opentelemetry.io/docs/languages/java/api/#counter[OpenTelemetry Java documentation about Counters].
ja_jp: 詳細については、 https://opentelemetry.io/docs/languages/java/api/#counter[カウンターに関する OpenTelemetry Java ドキュメント] を参照してください。

source: For more details please refer to the https://opentelemetry.io/docs/languages/java/instrumentation/#using-counters[OpenTelemetry Java documentation about Counters].
ja_jp: 詳細は、 https://opentelemetry.io/docs/languages/java/instrumentation/#using-counters[カウンターに関する OpenTelemetry Java ドキュメント] を参照してください。

source: For more details please refer to the xref:logging.adoc#logging-adapters[Logging guide].
ja_jp: 詳しくは、link:logging.html#logging-adapters[Loggingガイド] をご覧ください。

source: For more details please refer to the xref:logging.adoc#logging-apis[Logging guide].
ja_jp: 詳細は、xref:logging.adoc#logging-apis[ログ記録ガイド] を参照してください。

source: For more details please take a look at the https://github.com/quarkusio/quarkus/blob/main/integration-tests/opentelemetry/src/main/java/io/quarkus/it/opentelemetry/ExporterResource.java[ExporterResource] in the Quarkus integration tests.
ja_jp: 詳細については、Quarkus 統合テストにある https://github.com/quarkusio/quarkus/blob/main/integration-tests/opentelemetry/src/main/java/io/quarkus/it/opentelemetry/ExporterResource.java[ExporterResource] を参照してください。

source: For more details, check out the https://github.com/grpc/grpc/blob/v1.28.1/doc/health-checking.md[gRPC documentation]
ja_jp: 詳細については、 link:https://github.com/grpc/grpc/blob/v1.28.1/doc/health-checking.md[gRPCのドキュメント] を確認してください。

source: For more details, please see
ja_jp: 詳しくはこちらをご覧ください。

source: For more details, see the Keycloak documentation about how to https://www.keycloak.org/docs/latest/server_admin/index.html#_create-realm[create a new realm].
ja_jp: 詳細は、 https://www.keycloak.org/docs/latest/server_admin/index.html#_create-realm[新規レルムの作成] 方法に関する Keycloak ドキュメントを参照してください。

source: For more examples, please consult the xref:hibernate-orm-panache.adoc[Java version] for complete details. Both APIs are the same and work identically except for some Kotlin-specific tweaks to make things feel more natural to Kotlin developers. These tweaks include things like better use of nullability and the lack of `Optional` on API methods.
ja_jp: 更なるサンプルについては、 link:hibernate-orm-panache[Java 版] を参照してください。どちらの API も同じで、Kotlin 開発者がより自然に感じられるように Kotlin 固有の調整が行われている点を除いては同じように動作します。これらの調整には、nullability の使用方法の改善や、API メソッドの `Optional` がないことなどが含まれます。

source: For more examples, please consult the xref:mongodb-panache.adoc[Java version] for complete details. Both APIs are the same and work identically except for some Kotlin-specific tweaks to make things feel more natural to Kotlin developers. These tweaks include things like better use of nullability and the lack of `Optional` on API methods.
ja_jp: より詳しい例については、 link:mongodb-panache.html[Java版]を参照してください。どちらのAPIも同じで、Kotlin開発者がより自然に感じられるようにKotlin特有の調整を行っている以外は、同じように動作します。これらの調整には、nullabilityの使用方法の改善や、APIメソッドに `Optional` を使用しないことなどが含まれます。

source: For more flexibility, we introduced a `BuildItem`:
ja_jp: より柔軟に対応するために、 `BuildItem` を導入しました。

source: For more guidelines on writing cross-references, including the recommended path attributes, see xref:doc-reference.adoc#cross-references[Cross-references].
ja_jp: 推奨されるパス属性を含む相互参照の記述に関する詳細なガイドラインについては、xref:doc-reference.adoc#cross-references[相互参照] を参照してください。

source: For more in-depth dive into the details of the 3.0 release, <a href="https://quarkus.io/blog/quarkus-3-0-final-released/" target="_blank">check out the Quarkus 3.0 Release Notes</a>
ja_jp: 3.0リリースの詳細については、<a href="https://ja.quarkus.io/blog/quarkus-3-0-final-released/" target="_blank">Quarkus 3.0 リリースノートをご覧ください</a>。

source: For more info about events/observers visit https://docs.jboss.org/weld/reference/latest/en-US/html/events.html[Weld docs, window="_blank"].
ja_jp: イベント/オブザーバーの詳細については、 link:https://docs.jboss.org/weld/reference/latest/en-US/html/events.html[Weld ドキュメント, window=_blank]をご覧ください。

source: For more information about Basic authentication, its mechanisms, and related identity providers, see the following resources:
ja_jp: Basic認証、そのメカニズム、および関連するIDプロバイダーの詳細については、次のリソースを参照してください:

source: For more information about DMN support in Kogito, you may refer to the companion Quarkus guide specific to xref:kogito-dmn.adoc[Kogito DMN support on Quarkus], or the Kogito documentation in the links below.
ja_jp: KogitoでのDMNサポートの詳細については、link:kogito-dmn.html[QuarkusでのKogito DMN]サポートに特化したQuarkus手引きガイド、または以下のリンクにあるKogitoのドキュメントを参照してください。

source: For more information about DMN, you can reference the Kogito documentation at the links below.
ja_jp: DMNの詳細については、ページ下部のリンクからKogitoのドキュメントを参照できます。

source: For more information about Dev Services, see xref:dev-services.adoc[Dev Services overview].
ja_jp: Dev Services の詳細については、 xref:dev-services.adoc[Dev Services の概要] を参照してください。

source: For more information about GraalVM resource handling in native executables please refer to https://github.com/oracle/graal/blob/master/docs/reference-manual/native-image/Resources.md[the GraalVM documentation].
ja_jp: ネイティブ実行可能ファイルにおけるGraalVMのリソース処理についての詳細は、 link:https://github.com/oracle/graal/blob/master/docs/reference-manual/native-image/Resources.md[GraalVMのドキュメント]を参照してください。

source: For more information about GraalVM resource handling in native executables please refer to https://www.graalvm.org/{graalvm-version}/reference-manual/native-image/dynamic-features/Resources/[the GraalVM documentation].
ja_jp: ネイティブ実行可能ファイルにおけるGraalVMのリソース処理についての詳細は、 https://www.graalvm.org/{graalvm-version}/reference-manual/native-image/dynamic-features/Resources/[GraalVMのドキュメント]を参照してください。

source: For more information about GraalVM resource handling in native executables, see the link:https://www.graalvm.org/{graalvm-docs-version}/reference-manual/native-image/dynamic-features/Resources/[GraalVM Accessing Resources in Native Image] guide.
ja_jp: ネイティブ実行可能ファイルでのGraalVMリソースの取り扱いについては、 link:https://www.graalvm.org/{graalvm-docs-version}/reference-manual/native-image/dynamic-features/Resources/[ネイティブ・イメージでのGraalVMリソース・アクセス] ガイドを参照してください。

source: For more information about Hibernate Envers, see link:https://hibernate.org/orm/envers/[hibernate.org/orm/envers/].
ja_jp: Hibernate Envers の詳細については、link:https://hibernate.org/orm/envers/[hibernate.org/orm/envers/] を参照してください。

source: For more information about Jakarta Persistence, see the xref:security-jpa.adoc[Quarkus Security with Jakarta Persistence] guide.
ja_jp: Jakarta Persistence の詳細は、xref:security-jpa.adoc[Quarkus Security と Jakarta Persistence] ガイドを参照してください。

source: For more information about OIDC Bearer token authentication, see the Quarkus xref:security-oidc-bearer-token-authentication.adoc[OpenID Connect (OIDC) Bearer token authentication] guide.
ja_jp: OIDC ベアラートークン認証の詳細は、Quarkus の xref:security-oidc-bearer-token-authentication.adoc[OpenID Connect (OIDC) ベアラートークン認証] ガイドを参照してください。

source: For more information about OIDC authentication and authorization methods that you can use to secure your Quarkus applications, see the following resources:
ja_jp: Quarkus アプリケーションの安全性を確保するために使用できる OIDC 認証および認可方法の詳細については、以下のリソースを参照してください:

source: For more information about OIDC authentication and authorization methods you can use to secure your Quarkus applications, see the following detailed resources:
ja_jp: Quarkusアプリケーションの保護のために使用できるOIDC認証および認可方法の詳細については、以下の詳細なリソースを参照してください：

source: For more information about Proxy Classes you can read https://github.com/oracle/graal/blob/master/docs/reference-manual/native-image/DynamicProxy.md[the GraalVM documentation].
ja_jp: プロキシクラスの詳細については、 link:https://github.com/oracle/graal/blob/master/docs/reference-manual/native-image/DynamicProxy.md[GraalVMのドキュメント]をご覧ください。

source: For more information about Proxy Classes you can read https://www.graalvm.org/{graalvm-version}/reference-manual/native-image/guides/configure-dynamic-proxies/[the GraalVM documentation].
ja_jp: プロキシクラスの詳細については、 https://www.graalvm.org/{graalvm-version}/reference-manual/native-image/guides/configure-dynamic-proxies/[GraalVMのドキュメント]をご覧ください。

source: For more information about Proxy Classes, see the link:https://www.graalvm.org/{graalvm-docs-version}/reference-manual/native-image/guides/configure-dynamic-proxies/[GraalVM Configure Dynamic Proxies Manually] guide.
ja_jp: プロキシ・クラスの詳細については、 link:https://www.graalvm.org/{graalvm-docs-version}/reference-manual/native-image/guides/configure-dynamic-proxies/[GraalVM による動的プロキシの手動設定] ガイドを参照してください。

source: For more information about Quarkus REST, please see the xref:rest-json.adoc[introductory REST JSON guide] or the xref:rest.adoc[Quarkus REST reference documentation].
ja_jp: Quarkus REST の詳細は、xref:rest-json.adoc[REST JSON 入門ガイド] または xref:rest.adoc[Quarkus REST リファレンスドキュメント] を参照してください。

source: For more information about Quarkus REST, please refer to the xref:rest.adoc[dedicated guide].
ja_jp: Quarkus RESTの詳細については、 xref:rest.adoc[専用ガイド] を参照してください。

source: For more information about Qute Web options, see the https://docs.quarkiverse.io/quarkus-qute-web/dev/index.html[Qute Web guide].
ja_jp: Qute Web オプションの詳細は、https://docs.quarkiverse.io/quarkus-qute-web/dev/index.html[Qute Web ガイド] を参照してください。

source: For more information about RESTEasy Reactive, please refer to the xref:resteasy-reactive.adoc[dedicated guide].
ja_jp: RESTEasy Reactiveの詳細については、 link:resteasy-reactive.html[専用ガイド]をご参照ください。

source: For more information about `--initialize-at-run-time`, please read https://github.com/oracle/graal/blob/master/docs/reference-manual/native-image/ClassInitialization.md[the GraalVM documentation].
ja_jp: `--initialize-at-run-time` の詳細については、 link:https://github.com/oracle/graal/blob/master/docs/reference-manual/native-image/ClassInitialization.md[GraalVMのドキュメント]をお読みください。

source: For more information about `--initialize-at-run-time`, please read https://www.graalvm.org/{graalvm-version}/reference-manual/native-image/optimizations-and-performance/ClassInitialization/[the GraalVM documentation].
ja_jp: `--initialize-at-run-time` の詳細については、 https://www.graalvm.org/{graalvm-version}/reference-manual/native-image/optimizations-and-performance/ClassInitialization/[GraalVMのドキュメント]をお読みください。

source: For more information about `Basic` or `Form` HTTP-based authentication, see the following resources:
ja_jp: `Basic` または `Form` HTTPベース認証の詳細については、次のリソースを参照してください:

source: For more information about `OIDC Client` and `Token Propagation` support in Quarkus, see the xref:security-openid-connect-client-reference.adoc[OpenID Connect (OIDC) and OAuth2 client and filters reference guide].
ja_jp: Quarkus での `OIDC Client` と `Token Propagation` のサポートの詳細は、xref:security-openid-connect-client-reference.adoc[OpenID Connect (OIDC) と OAuth2 クライアントおよびフィルターのリファレンスガイド] を参照してください。

source: For more information about `security-properties-file`, you can check out the guide of the xref:security-properties.adoc[quarkus-elytron-security-properties-file] extension.
ja_jp: `security-properties-file` の詳細については、xref:security-properties.adoc[quarkus-elytron-security-properties-file] エクステンションのガイドを確認してください。

source: For more information about additional parameters, see the link:https://jdbc.postgresql.org/documentation/head/connect.html[official documentation].
ja_jp: 追加パラメーターの詳細は、link:https://jdbc.postgresql.org/documentation/head/connect.html[公式ドキュメント] を参照してください。

source: For more information about configuration of the Hibernate Search ORM extension, refer to the <<configuration-reference,Configuration Reference>>.
ja_jp: Hibernate Search ORM エクステンションの設定に関する詳細は、<<configuration-reference,Configuration Reference>> を参照してください。

source: For more information about configuration of the Hibernate Search Standalone extension, refer to the <<configuration-reference,Configuration Reference>>.
ja_jp: Hibernate Search Standalone エクステンションの設定に関する詳細は、<<configuration-reference,Configuration Reference>> を参照してください。

source: For more information about configuration options related to coordination, see <<configuration-reference-coordination-outbox-polling>>.
ja_jp: 調整に関連する設定オプションの詳細については、 <<configuration-reference-coordination-outbox-polling>> を参照してください。

source: For more information about configuration options related to coordination, see xref:configuration-reference-coordination-outbox-polling[Configuration of coordination with outbox polling].
ja_jp: 連携に関連する設定オプションの詳細については、 xref:configuration-reference-coordination-outbox-polling[outboxポーリングによる連携の設定] を参照してください。

source: For more information about configuring JDBC, see <<jdbc-url,JDBC URL format reference>> and <<extensions-and-database-drivers-reference,Quarkus extensions and database drivers reference>>.
ja_jp: JDBC の設定の詳細は、<<jdbc-url,JDBC URL format reference>> および <<extensions-and-database-drivers-reference,Quarkus extensions and database drivers reference>> を参照してください。

source: For more information about configuring analyzers, see link:{hibernate-search-docs-url}#backend-elasticsearch-analysis[this section of the reference documentation].
ja_jp: アナライザーの設定の詳細は、 link:{hibernate-search-docs-url}#backend-elasticsearch-analysis[参照ドキュメントのこちらのセクション] を参照してください。

source: For more information about configuring other well-known providers, see xref:security-openid-connect-providers.adoc[OpenID Connect providers].
ja_jp: 他のよく知られているプロバイダーの設定に関する詳細は、xref:security-openid-connect-providers.adoc[OpenID Connect プロバイダー] を参照してください。

source: For more information about configuring passwords and roles, see xref:configure-the-application[Configure the application].
ja_jp: パスワードとロールの設定に関する詳細については、 xref:configure-the-application[アプリケーションの設定] を参照してください。

source: For more information about consuming and using a reactive datasource, see the Quarkus xref:reactive-sql-clients.adoc[Reactive SQL clients] guide.
ja_jp: リアクティブデータソースの消費と使用に関する詳細は、Quarkus xref:reactive-sql-clients.adoc[Reactive SQLクライアントガイド] を参照してください。

source: For more information about coordination in Hibernate Search, see link:{hibernate-search-doc-prefix}#coordination[this section of the reference documentation].
ja_jp: Hibernate Search の調整について詳しく知りたい方は、 link:{hibernate-search-doc-prefix}[リファレンスドキュメント] を参照してください。

source: For more information about coordination in Hibernate Search, see link:{hibernate-search-docs-url}#coordination[this section of the reference documentation].
ja_jp: Hibernate Search の調整の詳細は、 link:{hibernate-search-docs-url}#coordination[リファレンスドキュメントのこのセクション] を参照してください。

source: For more information about customizing Quarkus Security including reactive security, and how to register a security provider, see xref:security-customization.adoc[Security customization].
ja_jp: リアクティブセキュリティを含むQuarkus Securityのカスタマイズ、およびセキュリティプロバイダーの登録方法の詳細については、 xref:security-customization.adoc[セキュリティのカスタマイズ] を参照してください。

source: For more information about customizing Quarkus Security, including reactive security and how to register a security provider, see the Quarkus xref:security-customization.adoc[Security tips and tricks] guide.
ja_jp: リアクティブセキュリティやセキュリティプロバイダーの登録方法など、Quarkus Securityのカスタマイズに関する詳細は、Quarkus xref:security-customization.adoc[Security tips and tricks] ガイドを参照してください。

source: For more information about customizing `SecurityIdentity`, see the xref:security-customization.adoc#security-identity-customization[Security identity customization] section in the Quarkus "Security tips and tricks" guide.
ja_jp: `SecurityIdentity` のカスタマイズの詳細は、Quarkus "セキュリティーに関するヒントとコツ" ガイドの xref:security-customization.adoc#security-identity-customization[セキュリティーアイデンティティーのカスタマイズ] セクションを参照してください。

source: For more information about how Quarkus supports secure connections with SSL/TLS, see the xref:http-reference.adoc#ssl[HTTP reference] information.
ja_jp: QuarkusがSSL/TLSを使用してセキュアな接続をサポートする方法の詳細については、 xref:http-reference.adoc#ssl[HTTPリファレンス] 情報を参照してください。

source: For more information about how it is initialized and configured, see xref:security-openid-connect-dev-services.adoc[Dev Services for Keycloak].
ja_jp: 初期化および設定方法の詳細は、xref:security-openid-connect-dev-services.adoc[Dev Services for Keycloak] を参照してください。

source: For more information about how named queries work, go to the xref:hibernate-orm-panache.adoc#named-queries[Hibernate ORM] guide or to the xref:hibernate-reactive-panache.adoc#named-queries[Hibernate Reactive] guide.
ja_jp: 名前付きクエリの動作の詳細については、 xref:hibernate-orm-panache.adoc#named-queries[Hibernate ORM] ガイドまたは xref:hibernate-reactive-panache.adoc#named-queries[Hibernate Reactive] ガイドにアクセスしてください。

source: For more information about how to build an uber-jar, see our documentation:
ja_jp: uber-jar のビルド方法の詳細は、次のドキュメントを参照してください。

source: For more information about how to install and use the Quarkus CLI, see the xref:cli-tooling.adoc[Quarkus CLI] guide.
ja_jp: Quarkus CLIのインストールと使用方法の詳細については、 xref:cli-tooling.adoc[Quarkus CLI] ガイドを参照してください。

source: For more information about how to secure routes, see https://docs.openshift.com/container-platform/4.18/networking/routes/secured-routes.html[OpenShift Container Platform] documentation.
ja_jp: ルートを保護する方法の詳細については、 link:https://docs.openshift.com/container-platform/4.18/networking/routes/secured-routes.html[OpenShift Container Platform] のドキュメントを参照してください。

source: For more information about how you can secure your Quarkus applications by using Basic authentication, see the following resources:
ja_jp: Basic認証を使用してQuarkusアプリケーションを保護する方法の詳細については、次のリソースを参照してください:

source: For more information about initializing and configuring Dev Services for Keycloak, see the xref:security-openid-connect-dev-services.adoc[Dev Services for Keycloak] guide.
ja_jp: Dev Services for Keycloak の初期化と設定の詳細は、xref:security-openid-connect-dev-services.adoc[Dev Services for Keycloak] ガイドを参照してください。

source: For more information about managing pull requests, see link:https://github.com/quarkusio/quarkus/blob/main/COMMITTERS.adoc[Information for Quarkus Committers].
ja_jp: プルリクエストの管理の詳細は、link:https://github.com/quarkusio/quarkus/blob/main/COMMITTERS.adoc[Quarkus でコミットする方向けの情報] を参照してください。

source: For more information about managing the individual tenant configurations in multitenant OIDC deployments, see the xref:security-openid-connect-multitenancy.adoc#disable-tenant[Disabling tenant configurations] section in the "Using OpenID Connect (OIDC) multi-tenancy" guide.
ja_jp: マルチテナント OIDC デプロイメントにおける個々のテナント設定の管理に関する詳細は、"OpenID Connect (OIDC) マルチテナントの使用" ガイドの xref:security-openid-connect-multitenancy.adoc#disable-tenant[テナント設定の無効化] セクションを参照してください。

source: For more information about pool size adjustment properties, see the <<jdbc-configuration>> section.
ja_jp: プールサイズ調整プロパティーの詳細は、<<jdbc-configuration>> セクションを参照してください。

source: For more information about pool size adjustment properties, see the <<reactive-configuration>> section.
ja_jp: プールサイズ調整プロパティーの詳細は、<<reactive-configuration>> セクションを参照してください。

source: For more information about reflection in GraalVM, see the link:https://www.graalvm.org/{graalvm-docs-version}/reference-manual/native-image/dynamic-features/Reflection/[GraalVM Reflection in Native Image] guide.
ja_jp: GraalVMにおけるリフレクションの詳細については、 link:https://www.graalvm.org/{graalvm-docs-version}/reference-manual/native-image/dynamic-features/Reflection/[ネイティブイメージにおけるGraalVM リフレクション] ガイドを参照してください。

source: For more information about security events specific to the Quarkus OpenID Connect extension, please see the xref:security-oidc-code-flow-authentication.adoc#listen-to-authentication-events[Listening to important authentication events] section of the OIDC code flow mechanism for protecting web applications guide.
ja_jp: Quarkus OpenID Connectエクステンション固有のセキュリティイベントの詳細については、Webアプリケーションを保護するためのOIDCコードフローメカニズムガイドの xref:security-oidc-code-flow-authentication.adoc#listen-to-authentication-events[重要な認証イベントのリスニング] セクションを参照してください。
